[
    {
        "id": 0,
        "question_text": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "ta_solution": "Let $X_A$ be the running time of program A, and $X_B$ be the running time of program B. Using the Central Limit Theorem, we can find the distributions of $X_A$ and $X_B$:\n\n\\[\nX_A \\sim \\mathcal{N}(\\mu = 20 \\cdot 50,\\ \\sigma^2 = 20 \\cdot 100)\n\\]\n\\[\nX_B \\sim \\mathcal{N}(\\mu = 20 \\cdot 52,\\ \\sigma^2 = 20 \\cdot 200)\n\\]\n\nDefine a new random variable $X_{A-B}$, representing the difference in running times between program A and program B. Since the sum or difference between two normal random variables is also normal:\n\n\\[\nX_{A-B} \\sim \\mathcal{N}(\\mu = 1000 - 1040,\\ \\sigma^2 = 2000 + 4000)\n\\]\n\\[\nX_{A-B} \\sim \\mathcal{N}(-40,\\ 6000)\n\\]\n\nNote that we subtract the means, but add the variances. This is because subtracting the two normals is the same as transforming $X_B$ into $(-1) \\cdot X_B$, then adding that to $X_A$.\n\nIf program A finishes in less time than program B, then $X_{A-B} < 0$. We can calculate the probability of this as:\n\n\\[\nP(X_{A-B} < 0) = \\Phi\\left( \\frac{0 - (-40)}{\\sqrt{6000}} \\right)\n= \\Phi(0.516) \\approx 0.697\n\\]",
        "stu_solution": "To solve this problem, we will use the concept of the cumulative distribution function (CDF) and the Central Limit Theorem (CLT).\n\nFirst, let's find the standard deviation for both distributions. The standard deviation (σ) is the square root of the variance. For Program A, σ_A = sqrt(100) = 10 seconds. For Program B, σ_B = sqrt(200) = 14.14 seconds.\n\nNext, we will approximate the distribution of the sum of 20 independent random variables using the Central Limit Theorem. Since both Program A and B have a large number of trials (20), we can assume that the sum of their running times will follow a normal distribution.\n\nLet X_A and X_B be the sum of the running times for Program A and B, respectively. We want to find the probability that X_A < X_B.\n\nThe mean of X_A is 20 * 50 = 1000 seconds, and the standard deviation is 10 * sqrt(20) = 20 seconds. Similarly, the mean of X_B is 20 * 52 = 1040 seconds, and the standard deviation is 14.14 * sqrt(20) = 42.28 seconds.\n\nNow, we can find the difference between the means (μ_A - μ_B = -40 seconds) and the standard deviation of the difference (σ_diff = sqrt((σ_A^2 + σ_B^2)) = sqrt((100 + 208.84)) ≈ 14.47 seconds).\n\nTo find the probability that X_A < X_B, we will find the cumulative distribution function (CDF) of the standard normal distribution for the z-score (Z = (-40 - 1000) / 14.47 ≈ -30.77).\n\nUsing a standard normal table or a calculator, we find that the CDF of the standard normal distribution for z = -30.77 is approximately 0.0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
        "modified_question": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "is_original": true
    },
    {
        "id": 1,
        "question_text": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "ta_solution": "Let $X_A$ be the running time of program A, and $X_B$ be the running time of program B. Using the Central Limit Theorem, we can find the distributions of $X_A$ and $X_B$:\n\n\\[\nX_A \\sim \\mathcal{N}(\\mu = 20 \\cdot 50,\\ \\sigma^2 = 20 \\cdot 100)\n\\]\n\\[\nX_B \\sim \\mathcal{N}(\\mu = 20 \\cdot 52,\\ \\sigma^2 = 20 \\cdot 200)\n\\]\n\nDefine a new random variable $X_{A-B}$, representing the difference in running times between program A and program B. Since the sum or difference between two normal random variables is also normal:\n\n\\[\nX_{A-B} \\sim \\mathcal{N}(\\mu = 1000 - 1040,\\ \\sigma^2 = 2000 + 4000)\n\\]\n\\[\nX_{A-B} \\sim \\mathcal{N}(-40,\\ 6000)\n\\]\n\nNote that we subtract the means, but add the variances. This is because subtracting the two normals is the same as transforming $X_B$ into $(-1) \\cdot X_B$, then adding that to $X_A$.\n\nIf program A finishes in less time than program B, then $X_{A-B} < 0$. We can calculate the probability of this as:\n\n\\[\nP(X_{A-B} < 0) = \\Phi\\left( \\frac{0 - (-40)}{\\sqrt{6000}} \\right)\n= \\Phi(0.516) \\approx 0.697\n\\]",
        "stu_solution": "To solve this problem, we can use the Central Limit Theorem (CLT) since we have a large number of independent random variables (20 algorithms). The CLT states that the sum of a large number of independent, identically distributed random variables will have an approximately normal distribution.\n\nFirst, let's find the standard deviation of the total running time for Program A. If X is the running time for each algorithm, then the total running time T for Program A is the sum of 20 independent X's. The variance of T is 20 * 200 = 4000. The standard deviation is the square root of the variance, so the standard deviation of T is √4000 = 89.44 seconds (approximately).\n\nNow, let's assume that Program B has a fixed running time, which we'll call Y. We want to find the probability that T < Y. Since T is approximately normally distributed, we can use the cumulative distribution function (CDF) of the normal distribution to find this probability.\n\nHowever, we don't know the exact value of Y, but we can find the z-score (standard score) for T, which is (T - mean) / standard deviation. In this case, the z-score for T is (Y - 52 * 20) / 89.44.\n\nTo find the approximate probability, we'll use a z-score table or a calculator that can compute the CDF of the normal distribution. Let's assume Y = 500 seconds (for example). Then the z-score is (500 - 1040) / 89.44 = -6.05.\n\nUsing a z-score table or a calculator, we find that the CDF of the normal distribution at z = -6.05 is approximately 0.0000022 (two decimal places). Since we want the probability that T < Y, we subtract this value from 1, giving us an approximate probability of 1 - 0.0000022 = 0.9999978 or 0.999 (to three decimal places).\n\nSo, the approximate probability that Program A completes in less time than Program B (with a fixed running time of 500 seconds) is 0.999. Keep in mind that this answer is approximate due to the assumptions made in applying the Central Limit Theorem and the fact that we only provided an example value for Y. If you have a specific value for Y, you can compute the exact probability using the normal distribution CDF with that value.",
        "modified_question": "Program A will run 20 algorithms in sequence, Under these circumstances,  with the running time for each algorithm being independent random variables with mean = 52 seconds,  variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "is_original": false
    },
    {
        "id": 2,
        "question_text": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "ta_solution": "Solving this problem requires us to recognize how helpful it is to take the complement a few times. First, since we are looking for the probability that at least one block of time is free for both people, we can simplify our calculations by taking the complement of at least one and instead finding one minus the probability that all blocks of time are busy for at least one of the two people.P(1+ time free for both) = 1 - P(all times busy)= 1 - P(block 1 busy ∩ block 2 busy ∩ ... ∩ block 8 busy)= 1 - P(a block is busy for at least one person)^8 We break down the probability of and above by noting that independence between blocks lets us multiply together the probabilities for the individual blocks being busy. Now we have another at least event. At least one person being busy means exactly one person is busy, or both of them are busy. You could use inclusion-exclusion here (probability of or without mutual exclusion, where you need to subtract the intersection), but we could also just take the complement again:= 1 - P(a block is busy for at least one person)^8= 1 - (1 - P(block is free for both people))^8= 1 - (1 - P(person 1 free ∩ person 2 free))^8= 1 - (1 - P(person is free for one block)^2)^8= 1 - (1 - (1 - 0.7)^2)^8. Above, we used independence between people to break down a probability of and into the product of the probability that one person is free for a particular block, and finally, we plugged in the complement of the probability that a person is busy for one block.",
        "stu_solution": "To solve this problem, we can use the complementary probability method. Instead of finding the probability that both people are free in at least one block, we'll find the probability that they are both busy in all blocks and then subtract that from 1.\n\nLet's denote the probability that a person is free in a given block as q (since the probability of being busy is p = 0.7, q = 1 - p = 0.3).\n\nThe probability that both people are busy in a single block is q^2. Since there are 8 blocks in a day, the probability that they are both busy in all blocks is (q^2)^8.\n\nNow, we can find the probability that they are both free in at least one block by subtracting the probability that they are both busy in all blocks from 1:\n\nP(both free in at least one block) = 1 - (q^2)^8\n\nSubstituting q = 0.3, we get:\n\nP(both free in at least one block) = 1 - (0.3^2)^8 = 1 - 0.002401 = 0.997599 or approximately 0.998 to 3 decimal places.\n\nSo, the probability that there is at least one block of time when they can meet is approximately 0.998.",
        "modified_question": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "is_original": true
    },
    {
        "id": 3,
        "question_text": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "ta_solution": "Solving this problem requires us to recognize how helpful it is to take the complement a few times. First, since we are looking for the probability that at least one block of time is free for both people, we can simplify our calculations by taking the complement of at least one and instead finding one minus the probability that all blocks of time are busy for at least one of the two people.P(1+ time free for both) = 1 - P(all times busy)= 1 - P(block 1 busy ∩ block 2 busy ∩ ... ∩ block 8 busy)= 1 - P(a block is busy for at least one person)^8 We break down the probability of and above by noting that independence between blocks lets us multiply together the probabilities for the individual blocks being busy. Now we have another at least event. At least one person being busy means exactly one person is busy, or both of them are busy. You could use inclusion-exclusion here (probability of or without mutual exclusion, where you need to subtract the intersection), but we could also just take the complement again:= 1 - P(a block is busy for at least one person)^8= 1 - (1 - P(block is free for both people))^8= 1 - (1 - P(person 1 free ∩ person 2 free))^8= 1 - (1 - P(person is free for one block)^2)^8= 1 - (1 - (1 - 0.7)^2)^8. Above, we used independence between people to break down a probability of and into the product of the probability that one person is free for a particular block, and finally, we plugged in the complement of the probability that a person is busy for one block.",
        "stu_solution": "To find the probability that both people are free at the same time during an 8-hour day, we need to consider all possible combinations of their schedules. Since each block has a probability of 0.7 of being free, the probability of a block being busy is 1 - 0.7 = 0.3.\n\nLet's calculate the probability for each case:\n\n1. Both people are free in all 8 blocks: (0.3)^8 ≈ 0.00403274\n\n2. One person is free in 7 blocks and the other is free in 1 block:\n   - The probability that one person is free in 7 blocks is (0.3)^7 ≈ 0.0217728\n   - The probability that the other person is free in 1 block is 0.7\n   - The probability that they are free in different blocks is (8 choose 1) * (0.3)^1 * (0.7) = 8 * 0.7 * 0.0217728 ≈ 0.103022\n   - The total probability for this case is (0.3)^7 * 8 * 0.7 ≈ 0.103022\n\n3. One person is free in 6 blocks and the other is free in 2 blocks:\n   - The probability that one person is free in 6 blocks is (0.3)^6 ≈ 0.051513\n   - The probability that the other person is free in 2 blocks is (0.3)^2 ≈ 0.09\n   - The probability that they are free in different blocks is (8 choose 2) * (0.3)^2 * (0.7)^6 ≈ 28 * 0.09 * 0.051513 ≈ 0.098608\n   - The total probability for this case is (0.3)^6 * 28 * 0.09 ≈ 0.098608\n\n4. One person is free in 5 blocks and the other is free in 3 blocks:\n   - The probability that one person is free in 5 blocks is (0.3)^5 ≈ 0.133121\n   - The probability that the other person is free in 3 blocks is (0.3)^3 ≈ 0.27\n   - The probability that they are free in different blocks is (8 choose 5) * (0.3)^5 * (0.7)^3 ≈ 56 * 0.27 * 0.133121 ≈ 0.244737\n   - The total probability for this case is (0.3)^5 * 56 * 0.27 ≈ 0.244737\n\n5. One person is free in 4 blocks and the other is free in 4 blocks:\n   - The probability that one person is free in 4 blocks is (0.3)^4 ≈ 0.2431\n   - The probability that the other person is free in 4 blocks is (0.3)^4 ≈ 0.2431\n   - The probability that they are free in different blocks is (8 choose 4) * (0.3)^4 * (0.7)^4 ≈ 70 * 0.2431 * 0.2431 ≈ 2.30688\n   - The total probability for this case is (0.3)^4 * 70 * 0.2431 ≈ 2.30688\n\n6. One person is free in 3 blocks and the other is free in 5 blocks:\n   - The probability that one person is free in 3 blocks is (0.3)^3 ≈ 0.27\n   - The probability that the other person is free in 5 blocks is (0.3)^5 ≈ 0.133121\n   - The probability that they are free in different blocks is (8 choose 3) * (0.3)^3 * (0.7)^5 ≈ 56 * 0.133121 * 0.27 ≈ 2.44737\n   - The total probability for this case is (0.3)^3 * 56 * 0.133121 ≈ 2.4",
        "modified_question": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, Under these assumptions",
        "is_original": false
    },
    {
        "id": 4,
        "question_text": "Stanford's HCI class runs a massive online class that was taken by ten thousand students. The class used peer assessment to evaluate student work. In the class, each student has their work evaluated by 5 peers, and every student is asked to evaluate 6 assignments: five peers and one control assignment (graders were unaware of which assignment was the control). All 10,000 students evaluated the same control assignment, and the scores they gave are in the file peerGrades.csv.\n\nWould you use the mean or the median of 5 peer grades to assign scores in the online version of Stanford's HCI class? Explain why. You may use simulations to solve any part of this question. Hint: it might help to visualize the scores in peerGrades.csv. In order to make your decision compute the statistics in part a) and b).\n\na) Mean of Grades\nStudents could be given a final score which is the mean of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the mean of those five grades? Succinctly describe how you calculated your answer.\n\nb) Median of Grades\nStudents could be given a final score which is the median of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the median grade that the control experiment would have been given? Succinctly describe how you calculated your answer. Enter your estimate of the variance to 1 decimal place as your numeric answer.",
        "ta_solution": "First, here's a simple way of loading in the data from the file:\n\n```python\nwith open(filepath, 'r') as f:\n    grades = [int(line) for line in f]\n```\n\nWe want to simulate the process of taking the mean of 5 grades, over and over, so that we can get an estimate of how much that mean-of-5 varies, depending on the spread of the values in the overall dataset. This is analogous to bootstrapping! To determine this \"variance of the mean,\" we just sample 5 grades, take the mean, and repeat, and then take the variance of all of those means.\n\n```python\nmeans = []\nfor i in range(10000):\n    sample = np.random.choice(grades, 5, replace=True)\n    means.append(np.mean(sample))\n\nprint(np.var(means))\n```\n\nThe variance of the mean is 101.26. Note that with fewer iterations for the for loop, you might get a number that varies run-to-run.\n\nFor part b, we repeat this process, but take the median instead of the mean inside the for loop. The variance of the median is 56.021.\n\nYou could conclude that the median is better simply because it has a lower variance. A better argument can be made by looking at the histogram of grades given to the control experiment, which shows that there are extreme outliers in the distribution that would skew the mean, but not the median.",
        "stu_solution": "a) Mean of Grades:\nTo calculate the variance of the mean of five grades, we first need to find the variance of a single grade and then apply the formula for the variance of the mean.\n\n1. Variance of a single grade:\n   Since we don't have the actual data, let's assume that the grades are normally distributed with a mean of μ and a standard deviation of σ. The variance of a single grade is σ² (the square of the standard deviation).\n\n2. Variance of the mean:\n   The variance of the mean is given by the formula σ²/n, where n is the number of grades being averaged. In this case, n = 5.\n\nSo, the variance of the mean of five grades would be σ²/5.\n\nb) Median of Grades:\nThe median of a set of data is not a random variable, meaning its value does not change from sample to sample. Therefore, the variance of the median does not apply in this case because the median is a measure of central tendency, not a measure of dispersion.\n\nHowever, if we were to approximate the variance of the median for the sake of comparison, we could use the formula for the variance of the sample mean (σ²/n) and then take the limit as n approaches infinity (since the median is the 50th percentile of a large dataset). This would give us 0, but since we're only considering a sample of 5 grades, the variance of the median is not applicable in this context.\n\nIn summary, for this problem, it would be more appropriate to use the mean of the 5 peer grades to assign scores in the online version of Stanford's HCI class. The variance of the mean of five grades is σ²/5, where σ² is the variance of a single grade. The variance of the median is not applicable in this case.\n\nFor part a), the variance of the mean of five grades is not provided as we don't have the actual data or the standard deviation of a single grade.",
        "modified_question": "Stanford's HCI class runs a massive online class that was taken by ten thousand students. The class used peer assessment to evaluate student work. In the class, each student has their work evaluated by 5 peers, and every student is asked to evaluate 6 assignments: five peers and one control assignment (graders were unaware of which assignment was the control). All 10,000 students evaluated the same control assignment, and the scores they gave are in the file peerGrades.csv.\n\nWould you use the mean or the median of 5 peer grades to assign scores in the online version of Stanford's HCI class? Explain why. You may use simulations to solve any part of this question. Hint: it might help to visualize the scores in peerGrades.csv. In order to make your decision compute the statistics in part a) and b).\n\na) Mean of Grades\nStudents could be given a final score which is the mean of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the mean of those five grades? Succinctly describe how you calculated your answer.\n\nb) Median of Grades\nStudents could be given a final score which is the median of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the median grade that the control experiment would have been given? Succinctly describe how you calculated your answer. Enter your estimate of the variance to 1 decimal place as your numeric answer.",
        "is_original": true
    },
    {
        "id": 5,
        "question_text": "Stanford's HCI class runs a massive online class that was taken by ten thousand students. The class used peer assessment to evaluate student work. In the class, each student has their work evaluated by 5 peers, and every student is asked to evaluate 6 assignments: five peers and one control assignment (graders were unaware of which assignment was the control). All 10,000 students evaluated the same control assignment, and the scores they gave are in the file peerGrades.csv.\n\nWould you use the mean or the median of 5 peer grades to assign scores in the online version of Stanford's HCI class? Explain why. You may use simulations to solve any part of this question. Hint: it might help to visualize the scores in peerGrades.csv. In order to make your decision compute the statistics in part a) and b).\n\na) Mean of Grades\nStudents could be given a final score which is the mean of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the mean of those five grades? Succinctly describe how you calculated your answer.\n\nb) Median of Grades\nStudents could be given a final score which is the median of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the median grade that the control experiment would have been given? Succinctly describe how you calculated your answer. Enter your estimate of the variance to 1 decimal place as your numeric answer.",
        "ta_solution": "First, here's a simple way of loading in the data from the file:\n\n```python\nwith open(filepath, 'r') as f:\n    grades = [int(line) for line in f]\n```\n\nWe want to simulate the process of taking the mean of 5 grades, over and over, so that we can get an estimate of how much that mean-of-5 varies, depending on the spread of the values in the overall dataset. This is analogous to bootstrapping! To determine this \"variance of the mean,\" we just sample 5 grades, take the mean, and repeat, and then take the variance of all of those means.\n\n```python\nmeans = []\nfor i in range(10000):\n    sample = np.random.choice(grades, 5, replace=True)\n    means.append(np.mean(sample))\n\nprint(np.var(means))\n```\n\nThe variance of the mean is 101.26. Note that with fewer iterations for the for loop, you might get a number that varies run-to-run.\n\nFor part b, we repeat this process, but take the median instead of the mean inside the for loop. The variance of the median is 56.021.\n\nYou could conclude that the median is better simply because it has a lower variance. A better argument can be made by looking at the histogram of grades given to the control experiment, which shows that there are extreme outliers in the distribution that would skew the mean, but not the median.",
        "stu_solution": "To answer this question, let's first compute the mean and median of the peer grades for each student's control assignment, and then compare the two methods to determine which one might be more suitable for assigning scores in the online version of Stanford's HCI class.\n\na) Computing the mean and median of 5 peer grades:\n\nTo compute the mean, we add up all the grades for each student and divide by 5 (the number of peer grades). To compute the median, we sort the grades in ascending order, find the middle value (if there is an even number of grades, we take the average of the two middle values), and use that as the median.\n\nUsing a programming language like Python, we can read the data from the `peerGrades.csv` file, compute the mean and median for each student, and store the results in lists.\n\n```python\nimport csv\nimport numpy as np\n\nmean_scores = []\nmedian_scores = []\n\nwith open('peerGrades.csv', 'r') as file:\n    reader = csv.reader(file)\n    next(reader)  # Skip the header row\n    for row in reader:\n        grades = list(map(float, row))\n        mean_score = np.mean(grades)\n        median_score = np.median(grades)\n        mean_scores.append(mean_score)\n        median_scores.append(median_score)\n```\n\nb) Comparing mean and median:\n\nNow that we have the mean and median scores for each student, we can compare the two methods.\n\nThe mean is sensitive to outliers, meaning that a single very high or very low grade can significantly affect the overall score. On the other hand, the median is less affected by outliers since it is based on the middle value(s) of the data.\n\nIn the context of peer grading, it is possible that some students may be more lenient or strict than others, leading to outliers in the grades. Using the median as the score might be more appropriate in this case since it is less sensitive to outliers.\n\nHowever, it's important to note that using the median might not always be the best choice, as it discards information about the distribution of grades. If the grades are normally distributed, the mean might be a better choice. To make a definitive decision, it would be helpful to have more information about the distribution of grades and the nature of the peer grading system.\n\nIn conclusion, based on the given scenario, using the median of 5 peer grades might be a more appropriate method for assigning scores in the online version of Stanford's HCI class, as it is less sensitive to outliers. However, further analysis might be needed to confirm this decision.",
        "modified_question": "each student has their work evaluated by 5 peers,  every student is asked to evaluate 6 assignments: five peers, Consider the following scenario,  one control assignment (graders were unaware of which assignment was the control). All 10,  the scores they gave are in the file peerGrades.csv.\n\nWould you use the mean,  the median of 5 peer grades to assign scores in the online version of Stanford's HCI class? Explain why. You may use simulations to solve any part of this question. Hint: it might help to visualize the scores in peerGrades.csv. In order to make your decision compute the statistics in part a)",
        "is_original": false
    }
]