[
    {
        "id": 0,
        "question_text": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "ta_solution": "Let $X_A$ be the running time of program A, and $X_B$ be the running time of program B. Using the Central Limit Theorem, we can find the distributions of $X_A$ and $X_B$:\n\n\\[\nX_A \\sim \\mathcal{N}(\\mu = 20 \\cdot 50,\\ \\sigma^2 = 20 \\cdot 100)\n\\]\n\\[\nX_B \\sim \\mathcal{N}(\\mu = 20 \\cdot 52,\\ \\sigma^2 = 20 \\cdot 200)\n\\]\n\nDefine a new random variable $X_{A-B}$, representing the difference in running times between program A and program B. Since the sum or difference between two normal random variables is also normal:\n\n\\[\nX_{A-B} \\sim \\mathcal{N}(\\mu = 1000 - 1040,\\ \\sigma^2 = 2000 + 4000)\n\\]\n\\[\nX_{A-B} \\sim \\mathcal{N}(-40,\\ 6000)\n\\]\n\nNote that we subtract the means, but add the variances. This is because subtracting the two normals is the same as transforming $X_B$ into $(-1) \\cdot X_B$, then adding that to $X_A$.\n\nIf program A finishes in less time than program B, then $X_{A-B} < 0$. We can calculate the probability of this as:\n\n\\[\nP(X_{A-B} < 0) = \\Phi\\left( \\frac{0 - (-40)}{\\sqrt{6000}} \\right)\n= \\Phi(0.516) \\approx 0.697\n\\]",
        "stu_solution": "To solve this problem, we will use the Central Limit Theorem (CLT). The CLT states that if we have a large number of independent and identically distributed (i.i.d.) random variables, their sum will follow a normal distribution, regardless of the original distribution.\n\n                First, let's find the expected value and variance for the sum of the running times for each program.\n\n                For Program A, the expected value of the sum of 20 running times is 20 * 50 = 1000 seconds (or 166.67 minutes). The variance of the sum is 20 * 100 = 2000 seconds$^2$ (or 33.33 minutes$^2$).\n\n                For Program B, the expected value of the sum of 20 running times is 20 * 52 = 1040 seconds (or 17.33 minutes). The variance of the sum is 20 * 200 = 4000 seconds$^2$ (or 66.67 minutes$^2$).\n\n                Now, we want to find the probability that Program A completes in less time than B. This is equivalent to finding the probability that the sum of Program A's running times is less than the sum of Program B's running times.\n\n                Let X be the sum of Program A's running times and Y be the sum of Program B's running times. We want to find P(X < Y).\n\n                Since both X and Y follow normal distributions (due to the CLT), we can use the z-score to compare them. The z-score is calculated as (X - mean) / standard deviation.\n\n                The z-score for X is (1000 - 1040) / sqrt(2000) = -2.828. The z-score for Y is (1040 - 1000) / sqrt(4000) = 0.447.\n\n                Since we want to find the probability that X is less than Y, we can use the cumulative distribution function (CDF) of the normal distribution. The CDF of a standard normal distribution is given by the error function (erf).\n\n                The probability we are interested in is P(X < Y) = P(X - Y < 0) = P((X - 1000) / sqrt(2000) < (Y - 1000) / sqrt(4000)).\n\n                Simplifying this, we get P(Z_A < Z_B), where Z_A and Z_B are standard normal variables.\n\n                The z-scores are -2.828 and 0.447, so the probability we are interested in is approximately erf(-2.828) - erf(0.447).\n\n                Using a calculator, we find that erf(-2.828) ≈ 0.0034 and erf(0.447) ≈ 0.6615.\n\n                Therefore, the approximate probability that Program A completes in less time than B is 0.6615 - 0.0034 = 0.6581 or 65.81%.\n\n                Answer: The approximate probability that Program A completes in less time than B is 65.81%.",
        "modified_question": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "is_original": true
    },
    {
        "id": 1,
        "question_text": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "ta_solution": "Let $X_A$ be the running time of program A, and $X_B$ be the running time of program B. Using the Central Limit Theorem, we can find the distributions of $X_A$ and $X_B$:\n\n\\[\nX_A \\sim \\mathcal{N}(\\mu = 20 \\cdot 50,\\ \\sigma^2 = 20 \\cdot 100)\n\\]\n\\[\nX_B \\sim \\mathcal{N}(\\mu = 20 \\cdot 52,\\ \\sigma^2 = 20 \\cdot 200)\n\\]\n\nDefine a new random variable $X_{A-B}$, representing the difference in running times between program A and program B. Since the sum or difference between two normal random variables is also normal:\n\n\\[\nX_{A-B} \\sim \\mathcal{N}(\\mu = 1000 - 1040,\\ \\sigma^2 = 2000 + 4000)\n\\]\n\\[\nX_{A-B} \\sim \\mathcal{N}(-40,\\ 6000)\n\\]\n\nNote that we subtract the means, but add the variances. This is because subtracting the two normals is the same as transforming $X_B$ into $(-1) \\cdot X_B$, then adding that to $X_A$.\n\nIf program A finishes in less time than program B, then $X_{A-B} < 0$. We can calculate the probability of this as:\n\n\\[\nP(X_{A-B} < 0) = \\Phi\\left( \\frac{0 - (-40)}{\\sqrt{6000}} \\right)\n= \\Phi(0.516) \\approx 0.697\n\\]",
        "stu_solution": "To solve this problem, we will use the Central Limit Theorem (CLT). The CLT states that if we have a large number of independent and identically distributed (i.i.d.) random variables, their sum will follow a normal distribution, regardless of the original distribution.\n\n                First, let's calculate the mean and variance for the total running time of each program.\n\n                For Program A, the mean running time for each algorithm is 50 seconds, and there are 22 algorithms. So, the mean total running time for Program A is 22 * 50 = 1100 seconds or 18 minutes and 20 seconds. The variance for the total running time is 22 * 117 = 2597 seconds$^2$ or approximately 43.3 minutes$^2$.\n\n                For Program B, the mean running time for each algorithm is 60 seconds, and there are 19 algorithms. So, the mean total running time for Program B is 19 * 60 = 1140 seconds or 19 minutes and 20 seconds. The variance for the total running time is 19 * 224 = 4232 seconds$^2$ or approximately 67.2 minutes$^2$.\n\n                Now, we need to find the difference in the means and standard deviations of the total running times. The difference in means is 1140 - 1100 = 40 seconds. The standard deviation of the difference is the square root of the sum of the squared standard deviations, which is the square root of (43.3$^2$ + 67.2$^2$) = 88.7 minutes or approximately 1.48 hours.\n\n                Since the difference in means is 40 seconds and the standard deviation of the difference is 1.48 hours, the difference is much larger than the standard deviation. This suggests that the difference in the total running times is significant, and we can approximate the probability using a normal distribution.\n\n                To find the approximate probability, we can use the cumulative distribution function (CDF) of the normal distribution. The CDF of a normal distribution with mean μ and standard deviation σ is given by:\n\n                CDF(x) = P(X ≤ x) = Φ((x - μ) / σ)\n\n                where Φ(z) is the cumulative distribution function of the standard normal distribution.\n\n                In this case, we want to find the probability that Program A completes in less time than B, which is the probability that the difference in the total running times is less than 0. So, we want to find Φ((-40) / 1.48).\n\n                Using a calculator or software, we find that Φ((-40) / 1.48) ≈ 0.0000. This means that the probability is extremely small, approximately 0.0000 to three decimal places.\n\n                Therefore, it is highly unlikely that Program A completes in less time than Program B.",
        "modified_question": "Program A will run 22 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds, variance = 117 seconds$^2$. Program B will run 19 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 60 seconds, variance = 224 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "is_original": false
    },
    {
        "id": 2,
        "question_text": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "ta_solution": "Solving this problem requires us to recognize how helpful it is to take the complement a few times. First, since we are looking for the probability that at least one block of time is free for both people, we can simplify our calculations by taking the complement of at least one and instead finding one minus the probability that all blocks of time are busy for at least one of the two people.P(1+ time free for both) = 1 - P(all times busy)= 1 - P(block 1 busy ∩ block 2 busy ∩ ... ∩ block 8 busy)= 1 - P(a block is busy for at least one person)^8 We break down the probability of and above by noting that independence between blocks lets us multiply together the probabilities for the individual blocks being busy. Now we have another at least event. At least one person being busy means exactly one person is busy, or both of them are busy. You could use inclusion-exclusion here (probability of or without mutual exclusion, where you need to subtract the intersection), but we could also just take the complement again:= 1 - P(a block is busy for at least one person)^8= 1 - (1 - P(block is free for both people))^8= 1 - (1 - P(person 1 free ∩ person 2 free))^8= 1 - (1 - P(person is free for one block)^2)^8= 1 - (1 - (1 - 0.7)^2)^8. Above, we used independence between people to break down a probability of and into the product of the probability that one person is free for a particular block, and finally, we plugged in the complement of the probability that a person is busy for one block.",
        "stu_solution": "To solve this problem, we will use the complementary probability method. Instead of finding the probability that both people are free in at least one block, we will find the probability that they are both busy in all blocks, and then subtract that from 1.\n\n                The probability that both people are busy in a given block is $p^2$, since the events are independent. Since there are 8 blocks in a day, the probability that they are both busy in all blocks is $(p^2)^8$.\n\n                Therefore, the probability that they are both free in at least one block is:\n\n                P(both free in at least one block) = 1 - P(both busy in all blocks) = 1 - $(p^2)^8$ = 1 - (0.7)^16 ≈ 0.9999999999999999\n\n                To three decimal places, the probability is approximately 1.000. This means that there is almost certainty that the two people can find at least one block of time when they are both free on a given day.",
        "modified_question": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "is_original": true
    },
    {
        "id": 3,
        "question_text": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "ta_solution": "Solving this problem requires us to recognize how helpful it is to take the complement a few times. First, since we are looking for the probability that at least one block of time is free for both people, we can simplify our calculations by taking the complement of at least one and instead finding one minus the probability that all blocks of time are busy for at least one of the two people.P(1+ time free for both) = 1 - P(all times busy)= 1 - P(block 1 busy ∩ block 2 busy ∩ ... ∩ block 8 busy)= 1 - P(a block is busy for at least one person)^8 We break down the probability of and above by noting that independence between blocks lets us multiply together the probabilities for the individual blocks being busy. Now we have another at least event. At least one person being busy means exactly one person is busy, or both of them are busy. You could use inclusion-exclusion here (probability of or without mutual exclusion, where you need to subtract the intersection), but we could also just take the complement again:= 1 - P(a block is busy for at least one person)^8= 1 - (1 - P(block is free for both people))^8= 1 - (1 - P(person 1 free ∩ person 2 free))^8= 1 - (1 - P(person is free for one block)^2)^8= 1 - (1 - (1 - 0.7)^2)^8. Above, we used independence between people to break down a probability of and into the product of the probability that one person is free for a particular block, and finally, we plugged in the complement of the probability that a person is busy for one block.",
        "stu_solution": "To solve this problem, we will use the complementary probability method. Instead of finding the probability that both people are free in at least one block, we will find the probability that both people are busy in all blocks and then subtract that from 1.\n\n                The probability that a person is busy in a given block is $p = 0.80$. Since the events are independent for each person and each block, the probability that both people are busy in a given block is $p^2 = (0.80)^2 = 0.64$.\n\n                Since there are 8 blocks in a day, the probability that both people are busy in all blocks is $(0.64)^8$.\n\n                Now, we can find the probability that there is at least one block when they are both free by subtracting the probability that they are both busy in all blocks from 1:\n\n                $P(\\text{at least one free block}) = 1 - P(\\text{both busy in all blocks}) = 1 - (0.64)^8 \\approx 0.367$.\n\n                So, the probability that there is at least one block of time when they can meet is approximately 0.367 to 3 decimal places.",
        "modified_question": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.80$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "is_original": false
    }
]