[
    {
        "id": 0,
        "question_text": "Program A will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 50 seconds and variance = 100 seconds$^2$. Program B will run 20 algorithms in sequence, with the running time for each algorithm being independent random variables with mean = 52 seconds and variance = 200 seconds$^2$. What is the approximate probability that Program A completes in less time than B? Give an answer to three decimal places.",
        "ta_solution": "Let $X_A$ be the running time of program A, and $X_B$ be the running time of program B. Using the Central Limit Theorem, we can find the distributions of $X_A$ and $X_B$:\n\n\\[\nX_A \\sim \\mathcal{N}(\\mu = 20 \\cdot 50,\\ \\sigma^2 = 20 \\cdot 100)\n\\]\n\\[\nX_B \\sim \\mathcal{N}(\\mu = 20 \\cdot 52,\\ \\sigma^2 = 20 \\cdot 200)\n\\]\n\nDefine a new random variable $X_{A-B}$, representing the difference in running times between program A and program B. Since the sum or difference between two normal random variables is also normal:\n\n\\[\nX_{A-B} \\sim \\mathcal{N}(\\mu = 1000 - 1040,\\ \\sigma^2 = 2000 + 4000)\n\\]\n\\[\nX_{A-B} \\sim \\mathcal{N}(-40,\\ 6000)\n\\]\n\nNote that we subtract the means, but add the variances. This is because subtracting the two normals is the same as transforming $X_B$ into $(-1) \\cdot X_B$, then adding that to $X_A$.\n\nIf program A finishes in less time than program B, then $X_{A-B} < 0$. We can calculate the probability of this as:\n\n\\[\nP(X_{A-B} < 0) = \\Phi\\left( \\frac{0 - (-40)}{\\sqrt{6000}} \\right)\n= \\Phi(0.516) \\approx 0.697\n\\]"
    },
    {
        "id": 1,
        "question_text": "You are trying to find a time when two people can meet. Assume a day is composed of 8 one hour blocks. Each block has $p = 0.7$ probability of being busy for each person. We assume that whether each block is busy for a person is independent of whether other blocks are busy for them, and also independent of whether that block is busy for other people. Question: Two people are trying to schedule a meeting. What is the probability that there is at least one block of time when they are both free on a given day? Provide an answer to 3 decimal places.",
        "ta_solution": "Solving this problem requires us to recognize how helpful it is to take the complement a few times. First, since we are looking for the probability that at least one block of time is free for both people, we can simplify our calculations by taking the complement of at least one and instead finding one minus the probability that all blocks of time are busy for at least one of the two people.P(1+ time free for both) = 1 - P(all times busy)= 1 - P(block 1 busy ∩ block 2 busy ∩ ... ∩ block 8 busy)= 1 - P(a block is busy for at least one person)^8 We break down the probability of and above by noting that independence between blocks lets us multiply together the probabilities for the individual blocks being busy. Now we have another at least event. At least one person being busy means exactly one person is busy, or both of them are busy. You could use inclusion-exclusion here (probability of or without mutual exclusion, where you need to subtract the intersection), but we could also just take the complement again:= 1 - P(a block is busy for at least one person)^8= 1 - (1 - P(block is free for both people))^8= 1 - (1 - P(person 1 free ∩ person 2 free))^8= 1 - (1 - P(person is free for one block)^2)^8= 1 - (1 - (1 - 0.7)^2)^8. Above, we used independence between people to break down a probability of and into the product of the probability that one person is free for a particular block, and finally, we plugged in the complement of the probability that a person is busy for one block."
    },
    {
        "id": 2,
        "question_text": "Stanford's HCI class runs a massive online class that was taken by ten thousand students. The class used peer assessment to evaluate student work. In the class, each student has their work evaluated by 5 peers, and every student is asked to evaluate 6 assignments: five peers and one control assignment (graders were unaware of which assignment was the control). All 10,000 students evaluated the same control assignment, and the scores they gave are in the file peerGrades.csv.\n\nWould you use the mean or the median of 5 peer grades to assign scores in the online version of Stanford's HCI class? Explain why. You may use simulations to solve any part of this question. Hint: it might help to visualize the scores in peerGrades.csv. In order to make your decision compute the statistics in part a) and b).\n\na) Mean of Grades\nStudents could be given a final score which is the mean of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the mean of those five grades? Succinctly describe how you calculated your answer.\n\nb) Median of Grades\nStudents could be given a final score which is the median of the 5 grades given by their peers. Imagine the control experiment had only received 5 peer-grades. What is the variance of the median grade that the control experiment would have been given? Succinctly describe how you calculated your answer. Enter your estimate of the variance to 1 decimal place as your numeric answer.",
        "ta_solution": "First, here's a simple way of loading in the data from the file:\n\n```python\nwith open(filepath, 'r') as f:\n    grades = [int(line) for line in f]\n```\n\nWe want to simulate the process of taking the mean of 5 grades, over and over, so that we can get an estimate of how much that mean-of-5 varies, depending on the spread of the values in the overall dataset. This is analogous to bootstrapping! To determine this \"variance of the mean,\" we just sample 5 grades, take the mean, and repeat, and then take the variance of all of those means.\n\n```python\nmeans = []\nfor i in range(10000):\n    sample = np.random.choice(grades, 5, replace=True)\n    means.append(np.mean(sample))\n\nprint(np.var(means))\n```\n\nThe variance of the mean is 101.26. Note that with fewer iterations for the for loop, you might get a number that varies run-to-run.\n\nFor part b, we repeat this process, but take the median instead of the mean inside the for loop. The variance of the median is 56.021.\n\nYou could conclude that the median is better simply because it has a lower variance. A better argument can be made by looking at the histogram of grades given to the control experiment, which shows that there are extreme outliers in the distribution that would skew the mean, but not the median."
    }
]